Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Id_ВСтороннемСервисе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВыполняемыеДействияRestApi.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>ВыполняемыеДействияRestApi</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обновление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноеОбновление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удаление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Пользователи/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	ВыполняемоеДействие = Неопределено;
		
	//Новый элемент создаем на сервисе, измененный - обновляем, 
	//помеченный на удаление - удаляем, при снятии пометки удаления - создаем вновь
	
	Если ЭтоНовый() Тогда

		ВыполняемоеДействие 		= Перечисления.ВыполняемыеДействияRestApi.Создание;
		
	Иначе

		ПометкаУдаленияТекущая 		= ПолучитьУстановленноеЗначениеПометкиНаУдаление();		
		ПометкаНаУдалениеИзменена 	= ?(ПометкаУдаления = ПометкаУдаленияТекущая, Ложь, Истина);
		
		Если ПометкаНаУдалениеИзменена Тогда
			
			Если ПометкаУдаления Тогда			
				ВыполняемоеДействие = Перечисления.ВыполняемыеДействияRestApi.Удаление;				
			Иначе				
				ВыполняемоеДействие = Перечисления.ВыполняемыеДействияRestApi.Создание;				
			КонецЕсли;

		ИначеЕсли НЕ ПометкаУдаления Тогда
			
			ВыполняемоеДействие = Перечисления.ВыполняемыеДействияRestApi.Обновление;
			
	    КонецЕсли;
		
	КонецЕсли;
	
	ТекстОшибки = "";
		
	Если ВыполняемоеДействие = Перечисления.ВыполняемыеДействияRestApi.Создание Тогда

		СтруктураПользователя 	= ПолучитьСтруктуруПользователяДляСервиса();		
		Id_ВСтороннемСервисе 	= ВыполнениеЗапросовAPI.СоздатьПользователяНаСервисе(СтруктураПользователя, Отказ, ТекстОшибки);
		
	ИначеЕсли ВыполняемоеДействие = Перечисления.ВыполняемыеДействияRestApi.Обновление Тогда

		СтруктураПользователя 	= ПолучитьСтруктуруПользователяДляСервиса();		
		ВыполнениеЗапросовAPI.ОбновитьПользователяНаСервисе(СтруктураПользователя, Id_ВСтороннемСервисе, Отказ, ТекстОшибки);
		
	ИначеЕсли ВыполняемоеДействие = Перечисления.ВыполняемыеДействияRestApi.Удаление Тогда

		СтруктураПользователя 	= ПолучитьСтруктуруПользователяДляСервиса();		
		ВыполнениеЗапросовAPI.УдалитьПользователяНаСервисе(Id_ВСтороннемСервисе, Отказ, ТекстОшибки);		
		
	КонецЕсли;

	
	Если Отказ Тогда

		Сообщение 		= новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось выполнить действие """ + ВыполняемоеДействие + """ на сервисе Rest-api. " + Символы.ПС + ТекстОшибки;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСтруктуруПользователяДляСервиса()
	
	СтруктураПользователя = Новый Структура;
	
	СтруктураПользователя.Вставить("name" , Наименование);
	СтруктураПользователя.Вставить("job"  , Работа);
	
	Возврат СтруктураПользователя;

КонецФункции

Функция ПолучитьУстановленноеЗначениеПометкиНаУдаление()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ПометкаНаУдалениеПоСсылке =  ВыборкаДетальныеЗаписи.ПометкаУдаления;
	Иначе
		ПометкаНаУдалениеПоСсылке = Неопределено;
	КонецЕсли;
	
	Возврат ПометкаНаУдалениеПоСсылке;

КонецФункции

#КонецОбласти
